import {EAnnotation} from './EAnnotation'
import {FClass} from './FClass'

//============================================================
// <T>描述类。</T>
//
// @property
// @param name:String 名称
// @author maocy
// @version 150104
//============================================================
export class FAnnotation {
   // 类对象
   protected _clazz: FClass = null;

   // 描述器类型
   protected _annotationCd: EAnnotation = null;

   // 名称
   protected _name: string = null;

   // 内容
   protected _value: any = null;

   // 可继承
   protected _inherit = false;

   // 可重复
   protected _duplicate = false;

   // 可有序
   protected _ordered = false;

   //============================================================
   // <T>构造处理。</T>
   //
   // @param name 名称
   //============================================================
   public constructor(name: string) {
      this._name = name;
   }
   
   //============================================================
   // <T>获得类对象。</T>
   //
   // @return 类对象
   //============================================================
   public get clazz(): FClass {
      return this._clazz;
   }
   
   //============================================================
   // <T>设置类对象。</T>
   //
   // @param clazz 类对象
   //============================================================
   public set clazz(clazz: FClass) {
      this._clazz = clazz;
   }

   //============================================================
   // <T>获得描述类型。</T>
   //
   // @return 描述类型
   //============================================================
   public get annotationCd():EAnnotation {
      return this._annotationCd;
   }

   //============================================================
   // <T>获得名称。</T>
   //
   // @return 名称
   //============================================================
   public get name() {
      return this._name;
   }

   //============================================================
   // <T>获得代码。</T>
   //
   // @return 代码
   //============================================================
   public get code() {
      return this._name;
   }
   
   //==========================================================
   // <T>获得内容。</T>
   //
   // @method
   // @return 内容
   //==========================================================
   public get value() {
      return this._value;
   }

   //============================================================
   // <T>判断是否允许继承。</T>
   //
   // @return 是否允许继承
   //============================================================
   public isInherit() {
      return this._inherit;
   }

   //============================================================
   // <T>判断是否允许重复。</T>
   //
   // @return 是否允许重复
   //============================================================
   public isDuplicate() {
      return this._duplicate;
   }

   //============================================================
   // <T>判断是否允许有序。</T>
   //
   // @return 是否允许有序
   //============================================================
   public isOrdered() {
      return this._ordered;
   }
}
