import {FDisplayContainer} from './FDisplayContainer';

//==========================================================
// <T>显示对象层。</T>
//
// @author maocy
// @history 160305
//==========================================================
export class FDisplayLayer extends FDisplayContainer {
   // 激活状态
   public statusActive: boolean = false;

   //==========================================================
   // <T>构造处理。</T>
   //==========================================================
   public constructor() {
      super();
   }

   //==========================================================
   // <T>激活处理。</T>
   //
   // @method
   //==========================================================
   public active() {
      this.statusActive = true;
   }

   //==========================================================
   // <T>取消激活处理。</T>
   //
   // @method
   //==========================================================
   public deactive() {
      this.statusActive = false;
   }
}