package org.mo.web.core.action.common;

import org.mo.com.lang.FObject;

//============================================================
// <T>网络命令。</T>
//============================================================
public class FWebAction
      extends FObject
{
   // 接口名称
   protected String _face;

   // 接口类
   protected Class<?> _faceClass;

   // 配置信息
   protected XAopAction _config;

   // 网络地址
   protected String _uri;

   //============================================================
   // <T>构造网络命令。</T>
   //============================================================
   public FWebAction(){
   }

   //============================================================
   // <T>获得接口名称。</T>
   //
   // @return 接口名称
   //============================================================
   public String face(){
      return _face;
   }

   //============================================================
   // <T>设置接口类。</T>
   //
   // @param face 接口名称
   //============================================================
   public void setFace(String face){
      _face = face;
   }

   //============================================================
   // <T>获得接口类。</T>
   //
   // @return 接口类
   //============================================================
   public Class<?> faceClass(){
      return _faceClass;
   }

   //============================================================
   // <T>设置接类。</T>
   //
   // @param face 接口类
   //============================================================
   public void setFaceClass(Class<?> clazz){
      _faceClass = clazz;
   }

   //============================================================
   // <T>获得网络地址。</T>
   //
   // @return 网络地址
   //============================================================
   public String uri(){
      return _uri;
   }

   //============================================================
   // <T>设置网络地址。</T>
   //
   // @param uri 网络地址
   //============================================================
   public void setUri(String uri){
      _uri = uri;
   }
}
