package org.mo.com.system;

import org.mo.com.lang.FObject;
import org.mo.com.lang.FObjects;

//============================================================
// <T>对象缓冲池。</T>
//============================================================
public class FObjectPool<T>
      extends FObject
{
   // 收集次数
   protected long _allocTotal;

   // 释放次数
   protected long _freeTotal;

   // 自由对象集合
   protected FObjects<T> _items;

   //============================================================
   // <T>构造对象缓冲池。</T>
   //============================================================
   //public FObjectPool(){
   //}

   //============================================================
   // <T>构造对象缓冲池。</T>
   //============================================================
   public FObjectPool(Class<T> clazz){
      _items = new FObjects<T>(clazz);
   }

   //============================================================
   // <T>获得收集次数。</T>
   //
   // @return 收集次数
   //============================================================
   public long allocTotal(){
      return _allocTotal;
   }

   //============================================================
   // <T>获得释放次数。</T>
   //
   // @return 释放次数
   //============================================================
   public long freeTotal(){
      return _freeTotal;
   }

   //============================================================
   // <T>获得项目个数。</T>
   //
   // @return 项目个数
   //============================================================
   public int itemCount(){
      return _items.count();
   }

   //============================================================
   // <T>判断是否含有指定数据内容。</T>
   //
   // @param value 数据内容
   // @return 是否含有
   //============================================================
   public boolean itemContains(T value){
      return _items.contains(value);
   }

   //============================================================
   // <T>获得项目集合。</T>
   //
   // @return 项目集合
   //============================================================
   public FObjects<T> items(){
      return _items;
   }

   //============================================================
   // <T>收集一个空闲对象。</T>
   //
   // @param item 对象
   //============================================================
   public synchronized T alloc(){
      T value = null;
      if(!_items.isEmpty()){
         value = _items.pop();
      }
      _allocTotal++;
      return value;
   }

   //============================================================
   // <T>释放一个空闲对象。</T>
   //
   // @param item 对象
   //============================================================
   public synchronized void free(T item){
      if(item != null){
         _items.push(item);
      }
      _freeTotal++;
   }

   //============================================================
   // <T>释放处理。</T>
   //============================================================
   public void release(){
      _items.clear();
   }
}
