package org.mo.data.logic.cache;

import org.mo.eng.cache.ICacheChannel;

//============================================================
// <T>逻辑单元缓冲控制台接口。</T>
//============================================================
public interface ILogicCacheConsole
{
   //============================================================
   // <T>测试是否允许。</T>
   //
   // @return 是否允许
   //============================================================
   boolean isEnable();

   //============================================================
   // <T>收集逻辑频道。</T>
   //
   // @param cacheChannel 内存频道
   // @return 逻辑频道
   //============================================================
   FLogicCacheChannel alloc(ICacheChannel cacheChannel);

   //============================================================
   // <T>释放逻辑频道。</T>
   //
   // @param logicChannel 逻辑频道
   //============================================================
   void free(FLogicCacheChannel logicChannel);
}
