package org.mo.com.message;

//============================================================
// <T>构造例外消息。</T>
//============================================================
public class FFatalMessage
      extends FAbstractMessage
{
   // 名称
   protected static String NAME = "Fatal";

   //============================================================
   // <T>构造例外消息。</T>
   //============================================================
   public FFatalMessage(){
   }

   //============================================================
   // <T>构造例外消息。</T>
   //
   // @param message 消息
   //============================================================
   public FFatalMessage(String message){
      super(message);
   }

   //============================================================
   // <T>构造例外消息。</T>
   //
   // @param message 消息
   // @param params 参数集合
   //============================================================
   public FFatalMessage(String message,
                        String... params){
      super(message, params);
   }

   //============================================================
   // <T>构造例外消息。</T>
   //
   // @param throwable 例外消息
   //============================================================
   public FFatalMessage(Throwable throwable){
      super(throwable);
   }

   //============================================================
   // <T>获得名称。</T>
   //
   // @return 名称
   //============================================================
   @Override
   public String name(){
      return NAME;
   }
}
