import {Content} from './Content';

//==========================================================
// <T>渲染缓冲。</T>
//
// @class
// @author maocy
// @history 150305
//==========================================================
export class Buffer extends Content {
   // 代码
   public code: string = null;
   // 数据
   public data: any = null;

   //==========================================================
   // <T>判断是否有效</T>
   //
   // @return 是否有效
   //==========================================================
   public isValid(): boolean {
      return true;
   }

   //==========================================================
   // <T>释放处理。</T>
   //==========================================================
   public dispose() {
      // 释放属性集合
      this.data = null;
      // 父处理
      super.dispose();
   }
}
